Тестовая_база_ERP_14/src/Documents/АГ_АссортиментныйПортфель/АГ_АссортиментныйПортфель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АГ_АссортиментныйПортфель</name>
  <comment>АГ:[+][УЗП0010][02.06.2019 15:45][Фирсанов]</comment>
  <registerRecords>InformationRegister.АГ_АссортиментныйПортфель</registerRecords>
  <attributes>
    <name>ТипПортфеля</name>
    <type>
      <types>EnumRef.АГ_ТипыАссортиментныхПортфелей</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.АГ_СтатусыДокументаАссортиментныйПортфель</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаРазвития</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериодаРазвития</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставПортфеля</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Класс</name>
      <type>
        <types>EnumRef.АГ_КлассыABCXYZ</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТонн</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентВариации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выручка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Enums/АГ_ТипыАссортиментныхПортфелей/АГ_ТипыАссортиментныхПортфелей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АГ_ТипыАссортиментныхПортфелей</name>
  <comment>АГ:[+][УЗП0010][02.06.2019 11:45][Фирсанов]</comment>
  <enumValues>
    <name>Базовый</name>
  </enumValues>
  <enumValues>
    <name>Развитие</name>
  </enumValues>
  <enumValues>
    <name>РазвитиеЗвездочка</name>
  </enumValues>
  <enumValues>
    <name>НаВывод</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/АГ_КлассыABCXYZ/АГ_КлассыABCXYZ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АГ_КлассыABCXYZ</name>
  <comment>АГ:[+][УЗП0010][02.06.2019 11:45][Фирсанов]</comment>
  <enumValues>
    <name>AX</name>
  </enumValues>
  <enumValues>
    <name>BX</name>
  </enumValues>
  <enumValues>
    <name>CX</name>
  </enumValues>
  <enumValues>
    <name>AY</name>
  </enumValues>
  <enumValues>
    <name>BY</name>
  </enumValues>
  <enumValues>
    <name>CY</name>
  </enumValues>
  <enumValues>
    <name>AZ</name>
  </enumValues>
  <enumValues>
    <name>BZ</name>
  </enumValues>
  <enumValues>
    <name>CZ</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/АГ_АссортиментныйПортфель/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	ДоступноИзменениеСтатусаАссортиментногоПортфеля	= РольДоступна(Метаданные.Роли.ПолныеПрава) ИЛИ РольДоступна(Метаданные.Роли.АГ_ИзменениеСтатусаАссортиментногоПортфеля);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступность();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НеВыполнятьПроверкуПередЗаписью Тогда
		НеВыполнятьПроверкуПередЗаписью = Ложь;
		Возврат;
	КонецЕсли;

	ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыЗаписи, Отказ);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПринудительноЗакрытьФорму = Истина;
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);
	
	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура ВыборПериодаРазвития(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Новый СтандартныйПериод(Объект.НачалоПериодаРазвития, Объект.КонецПериодаРазвития);
	Диалог.Показать(Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
//Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область Прочее

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаПериодРазвития.Видимость	= (Объект.ТипПортфеля=ПредопределенноеЗначение("Перечисление.АГ_ТипыАссортиментныхПортфелей.РазвитиеЗвездочка") 
		ИЛИ Объект.ТипПортфеля=ПредопределенноеЗначение("Перечисление.АГ_ТипыАссортиментныхПортфелей.Развитие"));
		
	Элементы.Статус.Доступность	= ДоступноИзменениеСтатусаАссортиментногоПортфеля;
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	//УсловноеОформление.Элементы.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ВыборПериодаЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда
		Объект.НачалоПериодаРазвития = Результат.ДатаНачала;
		Объект.КонецПериодаРазвития = Результат.ДатаОкончания; 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоставПортфеляКлассНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если Объект.ТипПортфеля<>ПредопределенноеЗначение("Перечисление.АГ_ТипыАссортиментныхПортфелей.РазвитиеЗвездочка") Тогда
		СтандартнаяОбработка	= Ложь;
		
		СписокВыбора	= Новый СписокЗначений;
		Если Объект.ТипПортфеля=ПредопределенноеЗначение("Перечисление.АГ_ТипыАссортиментныхПортфелей.Базовый") Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_КлассыABCXYZ.AX"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_КлассыABCXYZ.BX"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_КлассыABCXYZ.CX"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_КлассыABCXYZ.AY"));
		ИначеЕсли Объект.ТипПортфеля=ПредопределенноеЗначение("Перечисление.АГ_ТипыАссортиментныхПортфелей.Развитие") Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_КлассыABCXYZ.AZ"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_КлассыABCXYZ.CY"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_КлассыABCXYZ.BY"));
		ИначеЕсли Объект.ТипПортфеля=ПредопределенноеЗначение("Перечисление.АГ_ТипыАссортиментныхПортфелей.НаВывод") Тогда
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_КлассыABCXYZ.AZ"));
			СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.АГ_КлассыABCXYZ.BZ"));
		КонецЕсли;
		
		ДанныеВыбора	= СписокВыбора;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти
